#pragma once

// Name: mace, Version: 1.9.1.12285


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum MidairCE.EMAMatchResultType
enum class MidairCE_EMAMatchResultType : uint8_t
{
	EMAMatchResultType__Lose       = 0,
	EMAMatchResultType__Win        = 1,
	EMAMatchResultType__Draw       = 2,
	EMAMatchResultType__EMAMatchResultType_MAX = 3,

};

// Enum MidairCE.EDrillBotSpawnType
enum class MidairCE_EDrillBotSpawnType : uint8_t
{
	EDrillBotSpawnType__Immediate  = 0,
	EDrillBotSpawnType__SecondsBeforeGrab = 1,
	EDrillBotSpawnType__SecondsIntoRoute = 2,
	EDrillBotSpawnType__EDrillBotSpawnType_MAX = 3,

};

// Enum MidairCE.EDrillVictoryType
enum class MidairCE_EDrillVictoryType : uint8_t
{
	EDrillVictoryType__NoFlagCarrier = 0,
	EDrillVictoryType__FlagCaught  = 1,
	EDrillVictoryType__HitShot     = 2,
	EDrillVictoryType__TotalKills  = 3,
	EDrillVictoryType__TotalMidairs = 4,
	EDrillVictoryType__EDrillVictoryType_MAX = 5,

};

// Enum MidairCE.EPlayerRecordableInputTypes
enum class MidairCE_EPlayerRecordableInputTypes : uint8_t
{
	EPlayerRecordableInputTypes__Jet = 0,
	EPlayerRecordableInputTypes__Skii = 1,
	EPlayerRecordableInputTypes__Forward = 2,
	EPlayerRecordableInputTypes__Backwards = 3,
	EPlayerRecordableInputTypes__Left = 4,
	EPlayerRecordableInputTypes__Right = 5,
	EPlayerRecordableInputTypes__Fire = 6,
	EPlayerRecordableInputTypes__Yaw = 7,
	EPlayerRecordableInputTypes__FlagToss = 8,
	EPlayerRecordableInputTypes__WeaponSlot1 = 9,
	EPlayerRecordableInputTypes__WeaponSlot2 = 10,
	EPlayerRecordableInputTypes__WeaponSlot3 = 11,
	EPlayerRecordableInputTypes__NextWeapon = 12,
	EPlayerRecordableInputTypes__PreviousWeapon = 13,
	EPlayerRecordableInputTypes__ThrowGrenade = 14,
	EPlayerRecordableInputTypes__StopJet = 15,
	EPlayerRecordableInputTypes__StopSkii = 16,
	EPlayerRecordableInputTypes__StopFire = 17,
	EPlayerRecordableInputTypes__SetPitch = 18,
	EPlayerRecordableInputTypes__SetYaw = 19,
	EPlayerRecordableInputTypes__EPlayerRecordableInputTypes_MAX = 20,

};

// Enum MidairCE.EAugmentType
enum class MidairCE_EAugmentType : uint8_t
{
	EAugmentType__Passive          = 0,
	EAugmentType__Toggleable       = 1,
	EAugmentType__Triggerable      = 2,
	EAugmentType__EAugmentType_MAX = 3,

};

// Enum MidairCE.EFindSessionsSortMethod
enum class MidairCE_EFindSessionsSortMethod : uint8_t
{
	EFindSessionsSortMethod__None  = 0,
	EFindSessionsSortMethod__Default = 1,
	EFindSessionsSortMethod__PingAscending = 2,
	EFindSessionsSortMethod__PlayerCountDescending = 3,
	EFindSessionsSortMethod__NameAscending = 4,
	EFindSessionsSortMethod__NameDescending = 5,
	EFindSessionsSortMethod__SmartPingAndPlayers = 6,
	EFindSessionsSortMethod__EFindSessionsSortMethod_MAX = 7,

};

// Enum MidairCE.EPRMessage
enum class MidairCE_EPRMessage : uint8_t
{
	EPRMessage__Respawning         = 0,
	EPRMessage__Evacuating         = 1,
	EPRMessage__KilledSomething    = 2,
	EPRMessage__Progressed         = 3,
	EPRMessage__ProgressedWithTP   = 4,
	EPRMessage__SkippedToLesson    = 5,
	EPRMessage__Finished           = 6,
	EPRMessage__EPRMessage_MAX     = 7,

};

// Enum MidairCE.ERBMessage
enum class MidairCE_ERBMessage : uint8_t
{
	ERBMessage__CarrotDropped      = 0,
	ERBMessage__CarrotReset        = 1,
	ERBMessage__CarrotTaken        = 2,
	ERBMessage__RabbitKilled       = 3,
	ERBMessage__SelfPassTimeout    = 4,
	ERBMessage__ERBMessage_MAX     = 5,

};

// Enum MidairCE.EPowerupMessage
enum class MidairCE_EPowerupMessage : uint8_t
{
	EPowerupMessage__PickedUp      = 0,
	EPowerupMessage__Expired       = 1,
	EPowerupMessage__EPowerupMessage_MAX = 2,

};

// Enum MidairCE.ETDMMessage
enum class MidairCE_ETDMMessage : uint8_t
{
	ETDMMessage__FlagDropped       = 0,
	ETDMMessage__FlagPickedup      = 1,
	ETDMMessage__RabbitKilled      = 2,
	ETDMMessage__ETDMMessage_MAX   = 3,

};

// Enum MidairCE.EGameMessage
enum class MidairCE_EGameMessage : uint8_t
{
	EGameMessage__YouJoinedBlue    = 0,
	EGameMessage__YouJoinedRed     = 1,
	EGameMessage__GameStart        = 2,
	EGameMessage__GameOver         = 3,
	EGameMessage__GameOverSingle   = 4,
	EGameMessage__RoundOver        = 5,
	EGameMessage__NoTeamLivesLeft  = 6,
	EGameMessage__LastLiveLeft     = 7,
	EGameMessage__LastManStanding  = 8,
	EGameMessage__MaxDeployables   = 9,
	EGameMessage__VoteStarted      = 10,
	EGameMessage__RebalanceSoon    = 11,
	EGameMessage__RebalanceStarted = 12,
	EGameMessage__RebalanceEnded   = 13,
	EGameMessage__FlagHeldTooLong  = 14,
	EGameMessage__HasRabbitFlag    = 15,
	EGameMessage__PositionSaved    = 16,
	EGameMessage__PositionLoaded   = 17,
	EGameMessage__FlagReset        = 18,
	EGameMessage__FlagReturned     = 19,
	EGameMessage__FlagDropped      = 20,
	EGameMessage__FlagTaken        = 21,
	EGameMessage__TeamRabbitFlagTaken = 22,
	EGameMessage__FlagCarrierKilled = 23,
	EGameMessage__FlagCaptured     = 24,
	EGameMessage__StartOvertime    = 25,
	EGameMessage__GoalScored       = 26,
	EGameMessage__EGameMessage_MAX = 27,

};

// Enum MidairCE.EMAAudioClasses
enum class MidairCE_EMAAudioClasses : uint8_t
{
	EMAAudioClasses__Master        = 0,
	EMAAudioClasses__Effects       = 1,
	EMAAudioClasses__Music         = 2,
	EMAAudioClasses__GameEvents    = 3,
	EMAAudioClasses__Voice         = 4,
	EMAAudioClasses__EMAAudioClasses_MAX = 5,

};

// Enum MidairCE.EMappingPriority
enum class MidairCE_EMappingPriority : uint8_t
{
	EMappingPriority__None         = 0,
	EMappingPriority__Primary      = 1,
	EMappingPriority__Secondary    = 2,
	EMappingPriority__All          = 3,
	EMappingPriority__EMappingPriority_MAX = 4,

};

// Enum MidairCE.EMappingConflictResolution
enum class MidairCE_EMappingConflictResolution : uint8_t
{
	EMappingConflictResolution__KeepOriginal = 0,
	EMappingConflictResolution__KeepNew = 1,
	EMappingConflictResolution__DiscardBoth = 2,
	EMappingConflictResolution__KeepBoth = 3,
	EMappingConflictResolution__EMappingConflictResolution_MAX = 4,

};

// Enum MidairCE.ESpectateMode
enum class MidairCE_ESpectateMode : uint8_t
{
	ESpectateMode__FreeCam         = 0,
	ESpectateMode__FollowPlayer    = 1,
	ESpectateMode__ESpectateMode_MAX = 2,

};

// Enum MidairCE.EFuzeMode
enum class MidairCE_EFuzeMode : uint8_t
{
	EFuzeMode__Timed               = 0,
	EFuzeMode__Impact              = 1,
	EFuzeMode__Proximity           = 2,
	EFuzeMode__EFuzeMode_MAX       = 3,

};

// Enum MidairCE.EMAServiceState
enum class MidairCE_EMAServiceState : uint8_t
{
	EMAServiceState__None          = 0,
	EMAServiceState__Authenticating = 1,
	EMAServiceState__Authenticated = 2,
	EMAServiceState__Retrying      = 3,
	EMAServiceState__FailedOSS     = 4,
	EMAServiceState__FailedService = 5,
	EMAServiceState__EMAServiceState_MAX = 6,

};

// Enum MidairCE.EPracticeRouteTrailHitDifficulty
enum class MidairCE_EPracticeRouteTrailHitDifficulty : uint8_t
{
	EPracticeRouteTrailHitDifficulty__Easy = 0,
	EPracticeRouteTrailHitDifficulty__Medium = 1,
	EPracticeRouteTrailHitDifficulty__Expert = 2,
	EPracticeRouteTrailHitDifficulty__EPracticeRouteTrailHitDifficulty_MAX = 3,

};

// Enum MidairCE.EPracticeMenuDataTypes
enum class MidairCE_EPracticeMenuDataTypes : uint8_t
{
	EPracticeMenuDataTypes__RouteNames = 0,
	EPracticeMenuDataTypes__RouteName = 1,
	EPracticeMenuDataTypes__RouteDescription = 2,
	EPracticeMenuDataTypes__GrabTime = 3,
	EPracticeMenuDataTypes__CaptureTime = 4,
	EPracticeMenuDataTypes__TotalTime = 5,
	EPracticeMenuDataTypes__GrabSpeed = 6,
	EPracticeMenuDataTypes__CaptureSpeed = 7,
	EPracticeMenuDataTypes__MaxSpeed = 8,
	EPracticeMenuDataTypes__AverageSpeed = 9,
	EPracticeMenuDataTypes__TotalMarkers = 10,
	EPracticeMenuDataTypes__HitMarkers = 11,
	EPracticeMenuDataTypes__TimeToGrab = 12,
	EPracticeMenuDataTypes__DrillName = 13,
	EPracticeMenuDataTypes__DrillDescription = 14,
	EPracticeMenuDataTypes__DrillNumberBots = 15,
	EPracticeMenuDataTypes__DrillLength = 16,
	EPracticeMenuDataTypes__DrillSpawnDelay = 17,
	EPracticeMenuDataTypes__EPracticeMenuDataTypes_MAX = 18,

};

// Enum MidairCE.EMAWeaponActivity
enum class MidairCE_EMAWeaponActivity : uint8_t
{
	EMAWeaponActivity__WEAP_None   = 0,
	EMAWeaponActivity__WEAP_TakeOut = 1,
	EMAWeaponActivity__WEAP_PowerUp = 2,
	EMAWeaponActivity__WEAP_Idle   = 3,
	EMAWeaponActivity__WEAP_DryFire = 4,
	EMAWeaponActivity__WEAP_Firing = 5,
	EMAWeaponActivity__WEAP_Overheated = 6,
	EMAWeaponActivity__WEAP_Reloading = 7,
	EMAWeaponActivity__WEAP_Charging = 8,
	EMAWeaponActivity__WEAP_Overcharged = 9,
	EMAWeaponActivity__WEAP_Overloaded = 10,
	EMAWeaponActivity__WEAP_Fizzle = 11,
	EMAWeaponActivity__WEAP_Custom1 = 12,
	EMAWeaponActivity__WEAP_Custom2 = 13,
	EMAWeaponActivity__WEAP_Custom3 = 14,
	EMAWeaponActivity__WEAP_Custom4 = 15,
	EMAWeaponActivity__WEAP_MAX    = 16,

};

// Enum MidairCE.ESliderPresentationStyle
enum class MidairCE_ESliderPresentationStyle : uint8_t
{
	ESliderPresentationStyle__DoNotDisplay = 0,
	ESliderPresentationStyle__DisplayAsInt = 1,
	ESliderPresentationStyle__DisplayAsFloat = 2,
	ESliderPresentationStyle__ESliderPresentationStyle_MAX = 3,

};

// Enum MidairCE.EObjectiveUpdateType
enum class MidairCE_EObjectiveUpdateType : uint8_t
{
	EObjectiveUpdateType__Nothing  = 0,
	EObjectiveUpdateType__ClearAll = 1,
	EObjectiveUpdateType__ReplaceAll = 2,
	EObjectiveUpdateType__CompleteObjective = 3,
	EObjectiveUpdateType__CompleteObjectiveWithText = 4,
	EObjectiveUpdateType__Append   = 5,
	EObjectiveUpdateType__RemoveLine = 6,
	EObjectiveUpdateType__Replace  = 7,
	EObjectiveUpdateType__EObjectiveUpdateType_MAX = 8,

};

// Enum MidairCE.EArmorSize
enum class MidairCE_EArmorSize : uint8_t
{
	EArmorSize__Light              = 0,
	EArmorSize__Medium             = 1,
	EArmorSize__Heavy              = 2,
	EArmorSize__Max                = 3,

};

// Enum MidairCE.ESensorResolutionStrength
enum class MidairCE_ESensorResolutionStrength : uint8_t
{
	ESensorResolutionStrength__None = 0,
	ESensorResolutionStrength__Low = 1,
	ESensorResolutionStrength__Medium = 2,
	ESensorResolutionStrength__High = 3,
	ESensorResolutionStrength__ESensorResolutionStrength_MAX = 4,

};

// Enum MidairCE.ESensorTrackingType
enum class MidairCE_ESensorTrackingType : uint8_t
{
	ESensorTrackingType__None      = 0,
	ESensorTrackingType__Radar     = 1,
	ESensorTrackingType__Motion    = 2,
	ESensorTrackingType__ESensorTrackingType_MAX = 3,

};

// Enum MidairCE.EMapVoteOption
enum class MidairCE_EMapVoteOption : uint8_t
{
	EMapVoteOption__Map1           = 0,
	EMapVoteOption__Map2           = 1,
	EMapVoteOption__Map3           = 2,
	EMapVoteOption__Map4           = 3,
	EMapVoteOption__Map5           = 4,
	EMapVoteOption__Random         = 5,
	EMapVoteOption__Mode1          = 6,
	EMapVoteOption__Mode2          = 7,
	EMapVoteOption__Mode3          = 8,
	EMapVoteOption__Refresh        = 9,
	EMapVoteOption__Discard        = 10,
	EMapVoteOption__EMapVoteOption_MAX = 11,

};

// Enum MidairCE.EMapVoteStage
enum class MidairCE_EMapVoteStage : uint8_t
{
	EMapVoteStage__NotVoting       = 0,
	EMapVoteStage__FirstRound      = 1,
	EMapVoteStage__SecondRound     = 2,
	EMapVoteStage__Taken           = 3,
	EMapVoteStage__EMapVoteStage_MAX = 4,

};

// Enum MidairCE.ESimpleVote
enum class MidairCE_ESimpleVote : uint8_t
{
	ESimpleVote__Abstain           = 0,
	ESimpleVote__Yes               = 1,
	ESimpleVote__No                = 2,
	ESimpleVote__ESimpleVote_MAX   = 3,

};

// Enum MidairCE.EPlayerVoiceState
enum class MidairCE_EPlayerVoiceState : uint8_t
{
	EPlayerVoiceState__Silent      = 0,
	EPlayerVoiceState__Talking     = 1,
	EPlayerVoiceState__Muted       = 2,
	EPlayerVoiceState__EPlayerVoiceState_MAX = 3,

};

// Enum MidairCE.EPowerupSize
enum class MidairCE_EPowerupSize : uint8_t
{
	PWSIZE_SMALL                   = 0,
	PWSIZE_MEDIUM                  = 1,
	PWSIZE_LARGE                   = 2,
	PWSIZE_MAX                     = 3,

};

// Enum MidairCE.EPowerupTypes
enum class MidairCE_EPowerupTypes : uint8_t
{
	PWER_NONE                      = 0,
	PWER_HEALTHSMALL               = 1,
	PWER_HEALTH                    = 2,
	PWER_HEALTHLARGE               = 3,
	PWER_AMMO                      = 4,
	PWER_IMPULSE                   = 5,
	PWER_ENERGY                    = 6,
	PWER_HOT                       = 7,
	PWER_DAMAGE                    = 8,
	PWER_SHOTGUN                   = 9,
	PWER_RANDOM                    = 10,
	PWER_MAX                       = 11,

};

// Enum MidairCE.ECameraMode
enum class MidairCE_ECameraMode : uint8_t
{
	ECameraMode__None              = 0,
	ECameraMode__FirstPerson       = 1,
	ECameraMode__ShoulderCamera    = 2,
	ECameraMode__OrbitCamera       = 3,
	ECameraMode__Freelook          = 4,
	ECameraMode__ECameraMode_MAX   = 5,

};

// Enum MidairCE.ELockState
enum class MidairCE_ELockState : uint8_t
{
	ELockState__Unlocked           = 0,
	ELockState__Locking            = 1,
	ELockState__Locked             = 2,
	ELockState__Tracking           = 3,
	ELockState__ELockState_MAX     = 4,

};

// Enum MidairCE.EDetectedState
enum class MidairCE_EDetectedState : uint8_t
{
	EDetectedState__Undetected     = 0,
	EDetectedState__Jamming        = 1,
	EDetectedState__Sensed         = 2,
	EDetectedState__Detected       = 3,
	EDetectedState__EDetectedState_MAX = 4,

};

// Enum MidairCE.ETeamAllegiance
enum class MidairCE_ETeamAllegiance : uint8_t
{
	ETeamAllegiance__Neutral       = 0,
	ETeamAllegiance__Friendly      = 1,
	ETeamAllegiance__Enemy         = 2,
	ETeamAllegiance__ETeamAllegiance_MAX = 3,

};

// Enum MidairCE.EDefinedItemType
enum class MidairCE_EDefinedItemType : uint8_t
{
	EDefinedItemType__Invalid      = 0,
	EDefinedItemType__Gameplay     = 1,
	EDefinedItemType__ArmorSkins   = 2,
	EDefinedItemType__WeaponSkins  = 3,
	EDefinedItemType__VoicePacks   = 4,
	EDefinedItemType__JetTrails    = 5,
	EDefinedItemType__Sprays       = 6,
	EDefinedItemType__EDefinedItemType_MAX = 7,

};

// Enum MidairCE.EPunishType
enum class MidairCE_EPunishType : uint8_t
{
	EPunishType__Kick              = 0,
	EPunishType__Ban               = 1,
	EPunishType__EPunishType_MAX   = 2,

};

// Enum MidairCE.EShieldType
enum class MidairCE_EShieldType : uint8_t
{
	EShieldType__Subtractive       = 0,
	EShieldType__Overshield        = 1,
	EShieldType__EShieldType_MAX   = 2,

};

// Enum MidairCE.ENetDeathType
enum class MidairCE_ENetDeathType : uint8_t
{
	ENetDeathType__TearOff         = 0,
	ENetDeathType__Revivable       = 1,
	ENetDeathType__None            = 2,
	ENetDeathType__ENetDeathType_MAX = 3,

};

// Enum MidairCE.ELevelSymmetryMode
enum class MidairCE_ELevelSymmetryMode : uint8_t
{
	ELevelSymmetryMode__None       = 0,
	ELevelSymmetryMode__MirrorX    = 1,
	ELevelSymmetryMode__MirrorY    = 2,
	ELevelSymmetryMode__Rotate     = 3,
	ELevelSymmetryMode__ELevelSymmetryMode_MAX = 4,

};

// Enum MidairCE.ESplineFinishAction
enum class MidairCE_ESplineFinishAction : uint8_t
{
	ESplineFinishAction__DestroyActor = 0,
	ESplineFinishAction__SwitchDirection = 1,
	ESplineFinishAction__ESplineFinishAction_MAX = 2,

};

// Enum MidairCE.EFunctionSuccess
enum class MidairCE_EFunctionSuccess : uint8_t
{
	EFunctionSuccess__Success      = 0,
	EFunctionSuccess__Fail         = 1,
	EFunctionSuccess__EFunctionSuccess_MAX = 2,

};

// Enum MidairCE.ELessonWinCondition
enum class MidairCE_ELessonWinCondition : uint8_t
{
	ELessonWinCondition__Kills     = 0,
	ELessonWinCondition__Score     = 1,
	ELessonWinCondition__MidairHits = 2,
	ELessonWinCondition__ReachedActor = 3,
	ELessonWinCondition__ELessonWinCondition_MAX = 4,

};

// Enum MidairCE.ELessonEndAction
enum class MidairCE_ELessonEndAction : uint8_t
{
	ELessonEndAction__None         = 0,
	ELessonEndAction__MovePlayerToLessonStart = 1,
	ELessonEndAction__MovePlayerToNextLesson = 2,
	ELessonEndAction__MovePlayerToCustomLesson = 3,
	ELessonEndAction__EndSection   = 4,
	ELessonEndAction__ELessonEndAction_MAX = 5,

};

// Enum MidairCE.EDialougeStackingRules
enum class MidairCE_EDialougeStackingRules : uint8_t
{
	EDialougeStackingRules__DontStack = 0,
	EDialougeStackingRules__Replace_leq_Priority = 1,
	EDialougeStackingRules__ReplaceAll = 2,
	EDialougeStackingRules__Enqueue = 3,
	EDialougeStackingRules__EDialougeStackingRules_MAX = 4,

};

// Enum MidairCE.EComplexStatusBarFillType
enum class MidairCE_EComplexStatusBarFillType : uint8_t
{
	EComplexStatusBarFillType__AdditionalValue = 0,
	EComplexStatusBarFillType__SubValue = 1,
	EComplexStatusBarFillType__EComplexStatusBarFillType_MAX = 2,

};

// Enum MidairCE.EMALeaderboardFormat
enum class MidairCE_EMALeaderboardFormat : uint8_t
{
	Number                         = 0,
	Seconds                        = 1,
	Milliseconds                   = 2,
	EMALeaderboardFormat_MAX       = 3,

};

// Enum MidairCE.EMALeaderboardSort
enum class MidairCE_EMALeaderboardSort : uint8_t
{
	None                           = 0,
	Ascending                      = 1,
	Descending                     = 2,
	EMALeaderboardSort_MAX         = 3,

};

// Enum MidairCE.EMALeaderboardUploadMethod
enum class MidairCE_EMALeaderboardUploadMethod : uint8_t
{
	KeepBest                       = 0,
	ForceUpdate                    = 1,
	EMALeaderboardUploadMethod_MAX = 2,

};

// Enum MidairCE.EMALeaderboardRequest
enum class MidairCE_EMALeaderboardRequest : uint8_t
{
	Global                         = 0,
	GlobalAroundUser               = 1,
	Friends                        = 2,
	Users                          = 3,
	EMALeaderboardRequest_MAX      = 4,

};

// Enum MidairCE.EMAMatchLobbyStatus
enum class MidairCE_EMAMatchLobbyStatus : uint8_t
{
	Stop                           = 0,
	Waiting                        = 1,
	Joining                        = 2,
	Started                        = 3,
	EMAMatchLobbyStatus_MAX        = 4,

};

// Enum MidairCE.EMAMatchServerStatus
enum class MidairCE_EMAMatchServerStatus : uint8_t
{
	Queuing                        = 0,
	Reserved                       = 1,
	Playing                        = 2,
	EMAMatchServerStatus_MAX       = 3,

};

// Enum MidairCE.EStatsType
enum class MidairCE_EStatsType : uint8_t
{
	EStatsType__Int32              = 0,
	EStatsType__Float              = 1,
	EStatsType__EStatsType_MAX     = 2,

};

// Enum MidairCE.EEdgeLockBehavior
enum class MidairCE_EEdgeLockBehavior : uint8_t
{
	Never                          = 0,
	Always                         = 1,
	Timed                          = 2,
	EEdgeLockBehavior_MAX          = 3,

};

// Enum MidairCE.ETargetPlacement
enum class MidairCE_ETargetPlacement : uint8_t
{
	ETargetPlacement__Above        = 0,
	ETargetPlacement__Centered     = 1,
	ETargetPlacement__Below        = 2,
	ETargetPlacement__ETargetPlacement_MAX = 3,

};

// Enum MidairCE.EAttachPerspective
enum class MidairCE_EAttachPerspective : uint8_t
{
	EAttachPerspective__Both       = 0,
	EAttachPerspective__FirstPerson = 1,
	EAttachPerspective__ThirdPerson = 2,
	EAttachPerspective__EAttachPerspective_MAX = 3,

};

// Enum MidairCE.EMAChatMemberStateChange
enum class MidairCE_EMAChatMemberStateChange : uint8_t
{
	ChatMemberStateChangeEntered   = 0,
	ChatMemberStateChangeLeft      = 1,
	ChatMemberStateChangeDisconnected = 2,
	ChatMemberStateChangeKicked    = 3,
	ChatMemberStateChangeBanned    = 4,
	EMAChatMemberStateChange_MAX   = 5,

};

// Enum MidairCE.EMAMatchType
enum class MidairCE_EMAMatchType : uint8_t
{
	Normal                         = 0,
	Warmup                         = 1,
	AR                             = 2,
	CTF                            = 3,
	InvalidMatchType               = 4,
	EMAMatchType_MAX               = 5,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct MidairCE.MASteamId
// 0x0008
struct FMASteamId
{
	unsigned char                                      UnknownData_CKD5[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.SteamUGCHandle
// 0x0008
struct FSteamUGCHandle
{
	unsigned char                                      UnknownData_UZLF[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.SteamLeaderBoard
// 0x0040
struct FSteamLeaderBoard
{
	struct FName                                       PlayerName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMASteamId                                  SteamId;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int                                                Score;                                                     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Rank;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        Details;                                                   // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                IconImage;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P2SE[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSteamUGCHandle                             HandleUGC;                                                 // 0x0030(0x0008) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               LocalPlayer;                                               // 0x0038(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XADS[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.StatValue
// 0x0008
struct FStatValue
{
	int                                                Total;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Best;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MatchHistory
// 0x00A0
struct FMatchHistory
{
	struct FString                                     MapName;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     GameMode;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     DemoId;                                                    // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     GameVersion;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	MidairCE_EMAMatchResultType                        ResultType;                                                // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TA91[0x3];                                     // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Time;                                                      // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Rank;                                                      // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Score1;                                                    // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Score2;                                                    // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatValue                                  Score;                                                     // 0x0054(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                                  Kills;                                                     // 0x005C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                                  Deaths;                                                    // 0x0064(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                                  Assists;                                                   // 0x006C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                                  Suicides;                                                  // 0x0074(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                                  Evacuations;                                               // 0x007C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_22UV[0x4];                                     // 0x0084(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Timestamp;                                                 // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   DateTime;                                                  // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.PlayerLocationAndState
// 0x002C
struct FPlayerLocationAndState
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Velocity;                                                  // 0x000C(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0018(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                              Energy;                                                    // 0x0024(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Health;                                                    // 0x0028(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.PlayerRecordableInput
// 0x0014
struct FPlayerRecordableInput
{
	MidairCE_EPlayerRecordableInputTypes               InputType;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DY70[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Pitch;                                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Yaw;                                                       // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InputStartTime;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InputDuration;                                             // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MARouteTrail
// 0x00B0
struct FMARouteTrail
{
	struct FString                                     RouteName;                                                 // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RouteDescription;                                          // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      TeamId;                                                    // 0x0020(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6TUQ[0x3];                                     // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              GrabTime;                                                  // 0x0024(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CaptureTime;                                               // 0x0028(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TotalTime;                                                 // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              GrabSpeed;                                                 // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CaptureSpeed;                                              // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxSpeed;                                                  // 0x0038(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AverageSpeed;                                              // 0x003C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerLocationAndState                     FlagGrabMarker;                                            // 0x0040(0x002C) (BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BB46[0x4];                                     // 0x006C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FPlayerLocationAndState>             MarkerLocations;                                           // 0x0070(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlayerRecordableInput>              PlayerInputs;                                              // 0x0080(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                      YawInputs;                                                 // 0x0090(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                      PitchInputs;                                               // 0x00A0(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MADrill
// 0x0080
struct FMADrill
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Description;                                               // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             RouteTrailNames;                                           // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                NumberOfBots;                                              // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DrillLength;                                               // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DrillSpawnDelay;                                           // 0x0038(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ResetFlagsOnStart;                                         // 0x003C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               BotsTakeDamage;                                            // 0x003D(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               BotsAlwaysFollowPath;                                      // 0x003E(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               BotsLoopIfAlive;                                           // 0x003F(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               BotsSpawnOnDifferentRoutes;                                // 0x0040(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	MidairCE_EDrillVictoryType                         VictoryType;                                               // 0x0041(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EJBF[0x2];                                     // 0x0042(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                DrillVictoryAmount;                                        // 0x0044(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	MidairCE_EDrillBotSpawnType                        BotSpawnType;                                              // 0x0048(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WA3T[0x3];                                     // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FPlayerLocationAndState                     InitialPlayerLocation;                                     // 0x004C(0x002C) (BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      InitialPlayerLocationTeam;                                 // 0x0078(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VH3M[0x7];                                     // 0x0079(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.MAMapPracticeData
// 0x0040
struct FMAMapPracticeData
{
	struct FString                                     MapName;                                                   // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Author;                                                    // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMARouteTrail>                       RouteTrails;                                               // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMADrill>                            Drills;                                                    // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.GameViewportInputState
// 0x0018
struct FGameViewportInputState
{
	unsigned char                                      UnknownData_BXEH[0x18];                                    // 0x0000(0x0018) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.LoadingScreenTipData
// 0x0018 (0x0020 - 0x0008)
struct FLoadingScreenTipData : public FTableRowBase
{
	struct FText                                       Tip;                                                       // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.LoadingScreenMapData
// 0x0068
struct FLoadingScreenMapData
{
	class UTexture2D*                                  Background;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                                  LoadingMusic;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     MapName;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Lore;                                                      // 0x0020(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FText                                       Authors;                                                   // 0x0038(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FText                                       Objectives;                                                // 0x0050(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.BackpackArt
// 0x0020
struct FBackpackArt
{
	class UParticleSystem*                             Particle;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                GlowMaterialIndex;                                         // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KDKS[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UMaterialInterface*                          GlowMaterialOverride;                                      // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                                  PickupSound;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.CarriedObjectProperties
// 0x0010
struct FCarriedObjectProperties
{
	float                                              PickUpIgnoreTime;                                          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSendHomeOnTeamTouch;                                      // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LDUK[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              TossSpeed;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                AutoReturnTime;                                            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.RepMACharMovement
// 0x0024
struct FRepMACharMovement
{
	struct FVector_NetQuantize                         LinearVelocity;                                            // 0x0000(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         Location;                                                  // 0x000C(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0018(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MAPackedMove
// 0x0030
struct FMAPackedMove
{
	float                                              Timestamp;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DeltaTime;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           CompressedFlags;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    ViewRotator;                                               // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     LocalAccel;                                                // 0x0018(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BZQP[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AMAWeapon*                                   PendingWeapon;                                             // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MAPackedMoveBundle
// 0x0038
struct FMAPackedMoveBundle
{
	TArray<struct FMAPackedMove>                       Moves;                                                     // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         ClientLoc;                                                 // 0x0010(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TJ1N[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UPrimitiveComponent*                         ClientMovementBase;                                        // 0x0020(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ClientBaseBoneName;                                        // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ClientMovementMode;                                        // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7UWG[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.MADamageProfileEntry
// 0x0018
struct FMADamageProfileEntry
{
	class UClass*                                      DamageTypeClass;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageModifier;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShieldDamageModifier;                                      // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnergyDamageModifier;                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FAKR[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.DeathMessageData
// 0x0028
struct FDeathMessageData
{
	class AMAPlayerState*                              Killer;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMAPlayerState*                              Victim;                                                    // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMAPlayerState*                              Assist;                                                    // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      DamageTypeClass;                                           // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SkillRating;                                               // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QM2A[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.SimplePlayerStats
// 0x0008
struct FSimplePlayerStats
{
	int                                                TotalScore;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TimePlayedSec;                                             // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.ProgressionLevelData
// 0x0018 (0x0020 - 0x0008)
struct FProgressionLevelData : public FTableRowBase
{
	int                                                NewXPRequired;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BJCV[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<int>                                        SteamItemDefsGranted;                                      // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.TargetRenderModifiers
// 0x0078
struct FTargetRenderModifiers
{
	float                                              NearDistance;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FarDistance;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NearScale;                                                 // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FarScale;                                                  // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ViewCone;                                                  // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FadeRate;                                                  // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   GenericIconSize;                                           // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                          HealthbarMaterial;                                         // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   HealthbarSize;                                             // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                       Font;                                                      // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                Team0Color;                                                // 0x0038(0x0010) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                Team1Color;                                                // 0x0048(0x0010) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                FriendlyColor;                                             // 0x0058(0x0010) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                EnemyColor;                                                // 0x0068(0x0010) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.DamageMarkerInfo
// 0x0028
struct FDamageMarkerInfo
{
	float                                              Time;                                                      // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Highlight;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Damage;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     HitLocation;                                               // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAlive : 1;                                                // 0x0018(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_F0LP[0x7];                                     // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UMaterialInstanceDynamic*                    MaterialInstance;                                          // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.HitMarkerInfo
// 0x0018
struct FHitMarkerInfo
{
	float                                              Time;                                                      // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Damage;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bCriticalHit : 1;                                          // 0x0008(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bTeamHit : 1;                                              // 0x0008(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAlive : 1;                                                // 0x0008(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WQYK[0x7];                                     // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UMaterialInstanceDynamic*                    MaterialInstance;                                          // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct MidairCE.MidairInputConflict
// 0x0048
struct FMidairInputConflict
{
	unsigned char                                      UnknownData_9UR1[0x48];                                    // 0x0000(0x0048) MISSED OFFSET (PADDING)

};

// ScriptStruct MidairCE.MidairInputCategory
// 0x0040
struct FMidairInputCategory
{
	struct FName                                       Name;                                                      // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       CategoryName;                                              // 0x0008(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       CategoryTooltip;                                           // 0x0020(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint32_t                                           ConflictMask;                                              // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
